# Vaccination Rate US Counties

In [1]:
import pandas as pd
pd.set_option('display.max_rows', 10)
folder = r'C:\Users\Ensheng\Desktop\mapping\Data_NME\\'

## New York (NY)

* Sources:
    * https://health.data.ny.gov/Health/School-Immunization-Survey-District-Level-Map-2018/xq3k-6pt2
    * http://www.p12.nysed.gov/irs/statistics/enroll-n-staff/home.html
    * http://www.p12.nysed.gov/irs/statistics/nonpublic/

## Illinois (IL)

* Source: Immunization Status of School-Age Children in Illinois PDF
* Ignored: Other State Funded Public Schools

In [18]:
in_table = folder + r'IL\measles.xlsx'
df_il = pd.read_excel(in_table,sheet_name='measles2')
print(len(df_il))
df_il.head(3)

4868

   CountyCode  Enrollment PreK-12  Vaccination Acquired
0           1                 242                   242
1           1                 319                   317
2           1                 286                   286

In [29]:
in_table = folder + r'IL\measles.xlsx'
df_ilcode = pd.read_excel(in_table,sheet_name='Code')
print(len(df_ilcode))
df_ilcode.head(3)

104

   CountyCode     County
0           1      Adams
1           2  Alexander
2           3       Bond

In [30]:
# making sure all school has a convertable county code - GOOD!
print(set(df_ilcode['CountyCode']) - set(df_il['CountyCode']))
print(set(df_il['CountyCode']) - set(df_ilcode['CountyCode']))

{105}
{0}

In [37]:
# get county name for each school
temp = pd.merge(df_il, df_ilcode, how='left', on='CountyCode')
print(len(temp))
temp.head(3)

4868

   CountyCode  Enrollment PreK-12  Vaccination Acquired County
0           1                 242                   242  Adams
1           1                 319                   317  Adams
2           1                 286                   286  Adams

In [39]:
result = temp.groupby(['County'])['Enrollment PreK-12','Vaccination Acquired'].sum().reset_index()
print(len(result))
result.head(3)

103

      County  Enrollment PreK-12  Vaccination Acquired
0      Adams               10828                 10717
1  Alexander                 743                   732
2       Bond                2209                  2180

In [41]:
output_csv = folder + 'IL_NME' + '.csv'
result.to_csv(output_csv, index=False, encoding='utf-8')

## Michigan (MI)
83 counties

* Source: https://www.michigan.gov/documents/mdhhs/Kind_2018_Final_For_Website_663954_7.xlsx

In [3]:
in_table = folder + r'MI\Kind_2018_Final_For_Website_663954_7.xlsx'
df_mi = pd.read_excel(in_table,sheet_name='MI')
print(len(df_mi))
df_mi.head(3)

2057

,NAME,DISTRICT,COUNTY,N,COMP,PCT_COMP,PROV,INCOM
0,Alcona Elementary,Alcona Community Schools,Alcona,48,47,97.9,0,0
1,William G Mather Elementary School,Munising Public Schools,Alger,36,34,94.4,0,2
2,Superior Central School,Superior Central Schools,Alger,27,25,92.6,0,0

In [4]:
result = df_mi.groupby(['COUNTY'])['N','COMP'].sum().reset_index()
print(len(result))
result.head(3)

84

    COUNTY     N  COMP
0   Alcona    48    47
1    Alger    63    59
2  Allegan  1504  1434

In [5]:
output_csv = folder + 'MI_NME' + '.csv'
result.to_csv(output_csv, index=False, encoding='utf-8')

## Maine (ME)

* Source: https://www.maine.gov/dhhs/mecdc/infectious-disease/immunization/publications/

## Iowa (IA)
99 counties

* Source: ...
* Ignore S

In [42]:
in_table = folder + r'IA\2018-19 K-12 Grade Summary Report by School-converted.xlsx'
df_ia = pd.read_excel(in_table,sheet_name='IA')
print(len(df_ia))
df_ia.head(3)

1335

,County Name,School District Number,School Name,Certificate of Immunization,Total Enrollment,Percent Vaccinated with Vaccines Required by Law
0,Adair,2673,Nodaway Valley Elementary School,246,256,96.1
1,Adair,2673,Nodaway Valley High School,212,215,98.6
2,Adair,2673,Nodaway Valley Middle School,148,149,99.3

In [44]:
result = df_ia.groupby(['County Name'])['Certificate of Immunization','Total Enrollment'].sum().reset_index()
print(len(result))
result.head(3)

99

  County Name  Certificate of Immunization  Total Enrollment
0       Adair                          606               620
1       Adams                          360               367
2   Allamakee                         1871              2112

In [45]:
output_csv = folder + 'IA_NME' + '.csv'
result.to_csv(output_csv, index=False, encoding='utf-8')

## Kentucky (KY)
120 counties

* Kentucky School Districts: https://www.greatschools.org/schools/districts/Kentucky/KY/
* No data for Lewis and Mccreary

In [80]:
in_table = folder + r'KY\2018-19 Immunization_Certificates.xlsx'
df_ky = pd.read_excel(in_table,sheet_name='KY')
print(len(df_ky))
df_ky.head(3)

1177

      Dist Name  Enrolled  Standard Certificates
0  Adair County       219                    206
1  Adair County       191                    181
2  Allen County       232                    229

In [81]:
len(set(df_ky['Dist Name']))

170

In [82]:
df_kydst = pd.read_excel(in_table,sheet_name='district')
print(len(df_kydst))
df_kydst.head(3)

177

               Dist Name         City County name
0           Adair County     Columbia       Adair
1           Allen County  Scottsville       Allen
2  Anchorage Independent    Anchorage   Jefferson

In [83]:
len(set(df_kydst['Dist Name']))

177

In [84]:
set(df_ky['Dist Name']) - set(df_kydst['Dist Name']) # GOOD!

set()

In [93]:
set(df_kydst['Dist Name']) - set(df_ky['Dist Name'])

{'Jenkins Independent',
 'Kentucky  ',
 'Kentucky  For The Blind',
 'Kentucky  For The Deaf',
 'Kentucky Tech System',
 'Lewis County',
 'Mccreary County'}

In [85]:
temp = pd.merge(df_ky, df_kydst, how='left', left_on='Dist Name', right_on='Dist Name')
print(len(temp))
temp.head(3)

1177

      Dist Name  Enrolled  Standard Certificates         City County name
0  Adair County       219                    206     Columbia       Adair
1  Adair County       191                    181     Columbia       Adair
2  Allen County       232                    229  Scottsville       Allen

In [86]:
set(temp[temp['County name'].isnull()]['Dist Name'])

set()

In [94]:
result = temp.groupby(['County name'])['Enrolled','Standard Certificates'].sum().reset_index()
print(len(result))
result.head(3)

118

  County name  Enrolled  Standard Certificates
0       Adair       410                    387
1       Allen       491                    456
2    Anderson       573                    543

In [96]:
output_csv = folder + 'KY_VR' + '.csv'
result.to_csv(output_csv, index=False, encoding='utf-8')

## Idaho (ID)
44 counties

* Source: https://public.tableau.com/profile/idaho.division.of.public.health#!/vizhome/SIR2017_2018and2018_2019/IdahoSchoolImmunizationReport
* https://www.sde.idaho.gov/finance/

In [29]:
in_table = folder + r'ID\2017-18_School_Immunization_Rates_All_Grades_Combi_data.xlsx'
df_id = pd.read_excel(in_table,sheet_name='MMR_rate')
print(len(df_id))
df_id.head(3)

587

   MMR Adequate Rate               school name         City    Zip
0              0.976  a.b. mcdonald elementary       Moscow  83843
1              0.936      a.h. bush elementary  Idaho Falls  83402
2              0.935   a.j. winters elementary   Montpelier  83254

In [30]:
df_idzip = pd.read_excel(in_table,sheet_name='zip_county')
print(len(df_idzip))
df_idzip.head(3)

318

     Zip       City   County      Type
0  83201  Pocatello  Bannock  Standard
1  83202  Pocatello  Bannock  Standard
2  83203  Fort Hall  Bingham  P.O. Box

In [31]:
print(len(set(df_id['Zip'])))
print(len(set(df_idzip['Zip'])))
print(set(df_id['Zip'])-set(df_idzip['Zip'])) # GOOD!

179
318
set()

In [32]:
# get county name for zipcode
temp = pd.merge(df_id, df_idzip, how='left', on='Zip')
print(len(temp))
temp.head(3)

587

,MMR Adequate Rate,school name,City_x,Zip,City_y,County,Type
0,0.976,a.b. mcdonald elementary,Moscow,83843,Moscow,Latah,Standard
1,0.936,a.h. bush elementary,Idaho Falls,83402,Idaho Falls,Bonneville,Standard
2,0.935,a.j. winters elementary,Montpelier,83254,Montpelier,Bear Lake,Standard

### Average MMR rate

In [36]:
import numpy as np

In [101]:
df = temp[['County','MMR Adequate Rate']]
# find the mean and std dev.
#df.groupby("County").apply(np.std)

In [102]:
pd.set_option('display.max_rows', 50)
result = df.groupby(['County'], as_index=False).agg({'MMR Adequate Rate':['mean','std']})
#result

In [49]:
pd.set_option('display.max_rows', 10)
result = df.groupby(['County'])['MMR Adequate Rate'].mean().reset_index()
print(len(result))
result.head(3)

44

    County  MMR Adequate Rate
0      Ada           0.920711
1    Adams           0.864000
2  Bannock           0.939400

In [55]:
output_csv = folder + 'ID_NME' + '.csv'
result.to_csv(output_csv, index=False, encoding='utf-8')

### Enrollment

In [84]:
df_idenr = pd.read_excel(in_table,sheet_name='school_enroll')
print(len(df_idenr))
df_idenr.head(3)

# note: make sure school names are lowercases in both spreadsheets

739

                    school name  total_enrollment
0  3b juvenile detention center                13
1      a.b. mcdonald elementary               400
2          a.h. bush elementary               409

In [87]:
print(len(set(df_id['school name'])))
print(len(set(df_idenr['school name'])))

559
710

In [98]:
missing_schools = set(df_id['school name'])-set(df_idenr['school name'])
#print(len(missing_schools))
#print(missing_schools)

In [39]:
result = temp.groupby(['County'])['Enrollment PreK-12','Vaccination Acquired'].sum().reset_index()
print(len(result))
result.head(3)

103

      County  Enrollment PreK-12  Vaccination Acquired
0      Adams               10828                 10717
1  Alexander                 743                   732
2       Bond                2209                  2180

In [41]:
output_csv = folder + 'IL_NME' + '.csv'
result.to_csv(output_csv, index=False, encoding='utf-8')

## Rhode Island (RI)
5 counties

* Sources: 

    * web scrapping: http://www.health.ri.gov/data/schools/immunization/
    * city + county + population: https://en.wikipedia.org/wiki/List_of_municipalities_in_Rhode_Island

In [64]:
in_table = folder + r'RI\RI_online.xlsx'
df_ri = pd.read_excel(in_table,sheet_name='city_vr')
print(len(df_ri))
df_ri.head(3)

39

           city      county  pop2010    VR     pop_vr
0    Barrington     Bristol    16310  94.7  15445.570
1       Bristol     Bristol    22954  86.9  19947.026
2  Burrillville  Providence    15955  97.6  15572.080

In [65]:
result = df_ri.groupby(['county'])['pop_vr','pop2010'].sum().reset_index()
print(len(result))
result.head(3)

5

    county      pop_vr  pop2010
0  Bristol   45759.543    49875
1     Kent  161929.124   166158
2  Newport   78255.139    82888

In [66]:
output_csv = folder + 'RI_NME' + '.csv'
result.to_csv(output_csv, index=False, encoding='utf-8')

## Texas (TX)
254 counties
* https://www.dshs.texas.gov/immunize/coverage/schools/
* https://rptsvr1.tea.texas.gov/adhocrpt/adste.html

In [3]:
in_table = folder + r'TX\TX_MMR.xlsx'
df_tx = pd.read_excel(in_table,sheet_name='MMR')
print(len(df_tx))
df_tx.head(3)
# note: DISTRICT is sliced from "Facility Number"

1121

,DISTRICT,School Type,Facility Name,Facility Address,County,MMR
0,57273,Public ISD,International Leadership Of Texas,"4413 N Shiloh Rd, Garland, TX, 75044",Dallas,0.945786
1,1902,Public ISD,Cayuga ISD,"P O BOX 427, CAYUGA, TX, 75832",Anderson,0.972973
2,1903,Public ISD,Elkhart ISD,"301 E PARKER ST, ELKHART, TX, 75839",Anderson,0.989011

In [18]:
df_txenroll = pd.read_excel(in_table,sheet_name='K-enroll') # only the kindergarten
print(len(df_txenroll))
#df_txenroll = df_txenroll[df_txenroll['ENROLLMENT']!=-999] # remove -999
print(len(df_txenroll))
df_txenroll.head(3)

4537
4537

,YEAR,REGION,COUNTY NAME,DISTRICT,DISTRICT NAME,CAMPUS,CAMPUS NAME,GRADE GROUP NAME,GRADE,ENROLLMENT
0,2018-2019,7,ANDERSON COUNTY,1902,CAYUGA ISD,1902103,CAYUGA EL,ELEMENTARY,Kindergarten,38
1,2018-2019,7,ANDERSON COUNTY,1903,ELKHART ISD,1903101,ELKHART EL,ELEMENTARY,Kindergarten,91
2,2018-2019,7,ANDERSON COUNTY,1904,FRANKSTON ISD,1904102,FRANKSTON EL,ELEMENTARY,Kindergarten,62

In [19]:
result = df_txenroll.groupby(['DISTRICT'])['ENROLLMENT'].sum().reset_index()
print(len(result))
result.head(3)

1155

   DISTRICT  ENROLLMENT
0      1902          38
1      1903          91
2      1904          62

In [20]:
print(len(set(df_tx['DISTRICT'])))
print(len(set(df_txenroll['DISTRICT'])))
print(set(df_tx['DISTRICT'])-set(df_txenroll['DISTRICT']))
print(set(df_txenroll['DISTRICT'])-set(df_tx['DISTRICT']))

1121
1155
{227906, 21801, 178802, 86903, 57273}
{224902, 86024, 193801, 245904, 133905, 22903, 63906, 180901, 132902, 180903, 84903, 213801, 178808, 105905, 249906, 153907, 101810, 206902, 62905, 115903, 67908, 104903, 105802, 57804, 205901, 72910, 45903, 57810, 66005, 66901, 101847, 15835, 227806, 221801, 102901, 22902, 57846, 57848, 187901}

In [22]:
temp = pd.merge(df_tx, result, how='left', on='DISTRICT')
print(len(temp))
temp.head(3)

1121

,DISTRICT,School Type,Facility Name,Facility Address,County,MMR,ENROLLMENT
0,57273,Public ISD,International Leadership Of Texas,"4413 N Shiloh Rd, Garland, TX, 75044",Dallas,0.945786,NaN
1,1902,Public ISD,Cayuga ISD,"P O BOX 427, CAYUGA, TX, 75832",Anderson,0.972973,38.0
2,1903,Public ISD,Elkhart ISD,"301 E PARKER ST, ELKHART, TX, 75839",Anderson,0.989011,91.0

In [23]:
output_csv = folder + 'TX_temp' + '.csv'
temp.to_csv(output_csv, index=False, encoding='utf-8')

In [25]:
# In Excel: remove ENROLLMENT = NaN or < 0,mutiple MMR*ENROLLMENT
in_table = folder + r'TX\TX_temp.xlsx'
df_tx = pd.read_excel(in_table)
print(len(df_tx))
df_tx.head(3)

1009

,DISTRICT,School Type,Facility Name,Facility Address,County,MMR,ENROLLMENT,V_NUM
0,34902,Public ISD,Avinger ISD,"245 CONNOR ST, AVINGER, TX, 75630",Cass,1.0,5.0,5.0
1,65902,Public ISD,Hedley ISD,"P O BOX 69, HEDLEY, TX, 79237",Donley,1.0,5.0,5.0
2,90905,Public ISD,Grandview-Hopkins ISD,"11676 FM 293, GROOM, TX, 79039",Carson,1.0,5.0,5.0

In [26]:
result = df_tx.groupby(['County'])['ENROLLMENT','V_NUM'].sum().reset_index()
print(len(result))
result.head(3)

245

     County  ENROLLMENT       V_NUM
0  Anderson       607.0  590.955274
1   Andrews       361.0  353.044077
2  Angelina       647.0  634.000000

In [28]:
output_csv = folder + 'TX_NME' + '.csv'
result.to_csv(output_csv, index=False, encoding='utf-8')

## North Carolina (NC)
100 counties

In [9]:
in_table = folder + r'NC\NC_Converted.xlsx'
df_ncvr = pd.read_excel(in_table,sheet_name='VR')
print(len(df_ncvr))
df_ncvr.head(3)

1871

                 Name     VR
0            Alamance  0.012
1       Clover Garden  0.000
2  River Mill Academy  0.000

In [10]:
df_nccnty = pd.read_excel(in_table,sheet_name='County')
print(len(df_nccnty))
df_nccnty.head(3)

100

    FIPS     County State
0  37001   Alamance    NC
1  37003  Alexander    NC
2  37005  Alleghany    NC

In [11]:
temp = pd.merge(df_nccnty, df_ncvr, how='left', left_on='County', right_on='Name')
print(len(temp))
temp.head(3)

100

    FIPS     County State       Name     VR
0  37001   Alamance    NC   Alamance  0.012
1  37003  Alexander    NC  Alexander  0.000
2  37005  Alleghany    NC  Alleghany  0.065

In [12]:
output_csv = folder + 'NC_NME' + '.csv'
temp.to_csv(output_csv, index=False, encoding='utf-8')

---
# For all counties in the US

## Get FIPS

In [149]:
in_table = folder + r'Data_VR.xlsx'
df_vr = pd.read_excel(in_table,sheet_name='VR')
print(len(df_vr))
df_vr.head(3)

2423

     code   County State      VR     UVR   CountyName
0  1001.0  Autauga    AL  0.9639  0.0361  Autauga, AL
1  1003.0  Baldwin    AL  0.9653  0.0347  Baldwin, AL
2  1005.0  Barbour    AL  0.8827  0.1173  Barbour, AL

In [150]:
df_fips = pd.read_excel(in_table,sheet_name='FIPS')
print(len(df_fips))
df_fips.head(3)

3142

   FIPS   CountyName   County State
0  1001  Autauga, AL  Autauga    AL
1  1003  Baldwin, AL  Baldwin    AL
2  1005  Barbour, AL  Barbour    AL

In [151]:
len(set(df_fips['State']) - set(df_vr['State']))

13

In [152]:
# missing data for these states:
set(df_fips['State']) - set(df_vr['State'])

{'AK', 'AR', 'DC', 'DE', 'HI', 'MO', 'MS', 'NE', 'NH', 'NV', 'OH', 'VA', 'WV'}

In [153]:
print(len(set(df_vr['CountyName'])))
print(len(set(df_fips['CountyName'])))
print(set(df_vr['CountyName'])-set(df_fips['CountyName']))

2423
3137
set()

In [154]:
# 'Dade, FL', 'La Moure, ND', 'St Marys, MD', 'Lasalle, TX', 
# 'Weston, WY', 'Queen Annes, MD', 'Detroit, MI', 'La Porte, IN', 
# 'Gd Traverse, MI', 'Shannon, SD' -> Oglala Lakota, SD, 'Mclennan, TX', 'De Soto, FL', 'La Salle, LA', 'DeWitt, IL', 'Dona Ana, NM', 
# 'Mcmullen, TX', 'Mcculloch, TX', 'Prince Georges, MD', 'Dewitt, TX'
# {'Larue, KY', 'La Moure, ND', 'Mccracken, KY', 'Mclean, KY', 'Detroit, MI', 'De Kalb, TN'}

In [155]:
temp = pd.merge(df_vr, df_fips, how='left', on='CountyName')
print(len(temp))
temp.head(3)

2423

     code County_x State_x      VR     UVR   CountyName  FIPS County_y State_y
0  1001.0  Autauga      AL  0.9639  0.0361  Autauga, AL  1001  Autauga      AL
1  1003.0  Baldwin      AL  0.9653  0.0347  Baldwin, AL  1003  Baldwin      AL
2  1005.0  Barbour      AL  0.8827  0.1173  Barbour, AL  1005  Barbour      AL

In [158]:
temp_all = pd.merge(df_fips, df_vr, how='left', on='CountyName')
print(len(temp_all)) # must be the same as len(set(temp_all.FIPS))
print(len(set(temp_all.FIPS)))
temp_all.head(3)

3142
3142

   FIPS   CountyName County_x State_x    code County_y State_y      VR     UVR
0  1001  Autauga, AL  Autauga      AL  1001.0  Autauga      AL  0.9639  0.0361
1  1003  Baldwin, AL  Baldwin      AL  1003.0  Baldwin      AL  0.9653  0.0347
2  1005  Barbour, AL  Barbour      AL  1005.0  Barbour      AL  0.8827  0.1173

### add average VR for these states
* CDC: https://www.cdc.gov/mmwr/volumes/68/wr/mm6841e1.htm

In [168]:
df_ave = pd.read_excel(in_table,sheet_name='ave')
print(len(df_ave))
df_ave.head(3)

51

     State Abbr     VR    UVR
0  Alabama   AL  0.906  0.094
1   Alaska   AK    NaN    NaN
2  Arizona   AZ  0.929  0.071

In [176]:
vr_dic = pd.Series(df_ave.VR.values,index=df_ave.Abbr).to_dict()
uvr_dic = pd.Series(df_ave.UVR.values,index=df_ave.Abbr).to_dict()

In [177]:
list(set(df_fips['State']) - set(df_vr['State']))

['DC', 'WV', 'OH', 'HI', 'NE', 'NV', 'MS', 'DE', 'MO', 'VA', 'NH', 'AR', 'AK']

In [178]:
for i in list(set(df_fips['State']) - set(df_vr['State'])):
    temp_all.loc[temp_all['State_x'] == i,'VR'] = vr_dic[i]
    temp_all.loc[temp_all['State_x'] == i,'UVR'] = uvr_dic[i]

In [179]:
temp_all[temp_all['State_x']=='NH']

,FIPS,CountyName,County_x,State_x,code,County_y,State_y,VR,UVR
1764,33001,"Belknap, NH",Belknap,NH,NaN,NaN,NaN,0.918,0.082
1765,33003,"Carroll, NH",Carroll,NH,NaN,NaN,NaN,0.918,0.082
1766,33005,"Cheshire, NH",Cheshire,NH,NaN,NaN,NaN,0.918,0.082
1767,33007,"Coos, NH",Coos,NH,NaN,NaN,NaN,0.918,0.082
1768,33009,"Grafton, NH",Grafton,NH,NaN,NaN,NaN,0.918,0.082
1769,33011,"Hillsborough, NH",Hillsborough,NH,NaN,NaN,NaN,0.918,0.082
1770,33013,"Merrimack, NH",Merrimack,NH,NaN,NaN,NaN,0.918,0.082
1771,33015,"Rockingham, NH",Rockingham,NH,NaN,NaN,NaN,0.918,0.082
1772,33017,"Strafford, NH",Strafford,NH,NaN,NaN,NaN,0.918,0.082
1773,33019,"Sullivan, NH",Sullivan,NH,NaN,NaN,NaN,0.918,0.082

In [180]:
output_csv = folder + 'Data_VR_AllCounties' + '.csv'
temp_all.to_csv(output_csv, index=False, encoding='utf-8')

## Old NME

In [181]:
in_table = r'C:\Users\Ensheng\Desktop\mapping\diffusion_model\ModelInputOutputAll 4_23.csv'
df_nme = pd.read_csv(in_table)
print(len(df_nme))
df_nme.head(5)

3142

,County Name,State,FIPS,2015_NME,2016_NME,State_Avg_NME,Population,Static,Year2011,Year2012,Year2013,Year2014,Year2015,Year2016,Year2017,Year2018,Year2019
0,Autauga,Alabama,1001,NaN,NaN,0.006,55504,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
1,Baldwin,Alabama,1003,NaN,NaN,0.006,212628,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
2,Barbour,Alabama,1005,NaN,NaN,0.006,25270,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
3,Bibb,Alabama,1007,NaN,NaN,0.006,22668,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
4,Blount,Alabama,1009,NaN,NaN,0.006,58013,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0

In [182]:
set(temp_all['FIPS']) - set(df_nme['FIPS'])

set()

In [184]:
set(df_nme['FIPS']) - set(temp_all['FIPS'])

set()

In [185]:
df_nme['County'] = df_nme['County Name'] + ', ' + df_nme['State']

In [186]:
df_nme.loc[df_nme["2016_NME"].notnull(), 'FIPS_NME'] = df_nme['2016_NME']
df_nme.loc[(df_nme["FIPS_NME"].isnull()) & (df_nme["2015_NME"].notnull()), 'FIPS_NME'] = df_nme['2015_NME']
df_nme.loc[(df_nme["FIPS_NME"].isnull()) & (df_nme["State_Avg_NME"].notnull()), 'FIPS_NME'] = df_nme['State_Avg_NME']

In [188]:
# df_nme = df_nme[['FIPS','County','2016_NME','2015_NME','State_Avg_NME','FIPS_NME','Population']]
# print("No NME for the following counties:")
# df_nme.loc[df_nme['FIPS_NME'].isnull()]

In [8]:
output_csv = folder + 'old_NME' + '.csv'
df_nme.to_csv(output_csv, index=False, encoding='utf-8')

### Add Old NME

In [192]:
result = pd.merge(temp_all, df_nme, how='left', on='FIPS')
print(len(temp))
result.head(3)

3142

,FIPS,CountyName,County_x,State_x,code,County_y,State_y,VR,UVR,County,2016_NME,2015_NME,State_Avg_NME,FIPS_NME,Population
0,1001,"Autauga, AL",Autauga,AL,1001.0,Autauga,AL,0.9639,0.0361,"Autauga, Alabama",NaN,NaN,0.006,0.006,55504
1,1003,"Baldwin, AL",Baldwin,AL,1003.0,Baldwin,AL,0.9653,0.0347,"Baldwin, Alabama",NaN,NaN,0.006,0.006,212628
2,1005,"Barbour, AL",Barbour,AL,1005.0,Barbour,AL,0.8827,0.1173,"Barbour, Alabama",NaN,NaN,0.006,0.006,25270

In [193]:
output_csv = folder + 'Data_VR_AllCounties' + '.csv'
result.to_csv(output_csv, index=False, encoding='utf-8')